Tekla Open API Reference for Tekla Structures 2025
String.Value Property
 The value of the string datatype.
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string Value { get; set; }
Public Property Value As String
	Get
	Set
Property Value
Type: String
Implements
IStringDataType.Value
See Also
Reference
String Structure
Tekla.Structures.Datatype Namespace